Documents/Requests/Soap_Getcustomerdetails_cable__23_02_2022_15_27_02_Request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:vfd="http://amdocs/vfde/customer/VFDEGetCustomerDetails" xmlns:vfd1="http://amdocs/vfde/customer/VFDEGetCustomerDetailsInput">
    <soapenv:Header/>
    <soapenv:Body>
        <vfd:GetCustomerDetailsRequest>
            <vfd1:ROOT>
                <Event>
                    <Type>RetrieveCustomerInfo</Type>
                     <ID>7aa17bb2-034b-4c3f-9e43-e1acabdb4f11</ID>
                    <CallerID>OSF</CallerID>
                    <CorrelationID>33ccda73-a44a-4baf-8e1d-c46ddfb49a9d</CorrelationID>
                    <MessageCreationTimestamp>2022-02-23T05:53:38.479Z</MessageCreationTimestamp>
                </Event>
                <DATA>
                    <GlobalID>KD_</GlobalID>
                    <Mode>3</Mode>
                    <SourceSystemID>OSF.TCP</SourceSystemID>
                    <Portal>{{portal}}</Portal>
                </DATA>
            </vfd1:ROOT>
        </vfd:GetCustomerDetailsRequest>
    </soapenv:Body>
</soapenv:Envelope>